---
kind: other
id: Properties.T:Autodesk.Revit.DB.LinePatternSegment
source: html/b4a102d2-c3f6-fae9-31f4-ffa279b33f14.htm
---
# LinePatternSegment Properties

Specifies whether the .NET object represents a valid Revit entity.